Tekla.Structures.Analysis.AnalysisRestraintData.ReleaseTypeEnum
Defines the release type.

Tekla.Structures.Analysis.AnalysisRestraintData.ReleaseTypeEnum.FIXED_SUPPORTED
The fixed and supported type.

Tekla.Structures.Analysis.AnalysisRestraintData.ReleaseTypeEnum.PINNED_SUPPORTED
The pinned and supported type.

Tekla.Structures.Analysis.AnalysisRestraintData.ReleaseTypeEnum.FIXED_CONNECTED
The fixed and connected type.

Tekla.Structures.Analysis.AnalysisRestraintData.ReleaseTypeEnum.PINNED_CONNECTED
The pinned and connected type.

Tekla.Structures.Analysis.AnalysisRestraintData.ReleaseTypeEnum.USER_DEFINED
The user defined type.